/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   1342.将数字变成 0 的操作次数.cpp                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: taoyanqi <taoyanqi@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/09/24 18:05:52 by taoyanqi          #+#    #+#             */
/*   Updated: 2025/09/24 18:05:53 by taoyanqi         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

class Solution {
public:
    int numberOfSteps(int num) {
        int res = 0;
        while(num) {
            if(num % 2) {
                num--;
            } else {
                num = num >> 1;
            }
            res++;
        }
        return res;
        
    }
};