/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   1318.或运算的最小翻转次数.cpp                                :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: taoyanqi <taoyanqi@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/10/10 09:33:22 by taoyanqi          #+#    #+#             */
/*   Updated: 2025/10/10 09:33:48 by taoyanqi         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

class Solution {
public:
    // 最简单的方法就是一位位的比较，貌似没有更好的
    int minFlips(int a, int b, int c) {
        int res = 0;
        for(int i=0; i < 31; i++) {
            int x = (a >> i) & 1;
            int y = (b >> i) & 1;
            int z  = (c >> i) & 1;
            if(z == 0) {
                res += x + y;
            } else {
                res += (x + y == 0);
            }
        }
        return res;
        
    }
};