/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   3226.使两个整数相等的位更改次数.cpp                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: taoyanqi <taoyanqi@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/09/24 11:07:31 by taoyanqi          #+#    #+#             */
/*   Updated: 2025/09/24 11:07:31 by taoyanqi         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

class Solution {
public:
    int minChanges(int n, int k) {
        // 修改n的bit位，从集合的角度上删除一些数，剩余的集合和k集合是一致的
        // 也就是说 k 属于 n   n & k == k
        // 如果是子集的关系，也就是要求差集
        return (n & k) != k ? -1 : __builtin_popcount(n ^ k);
        
    }
};