# 动态规划问题总结

## 1. 爬楼梯
dp[i] = dp[i-1] + dp[i-2] 等其他变种, 当前i位置从哪个地方来
- 70
- 746
- 377
- 2466 

## 2.打家劫舍
相邻位置不能选择

dp[i] = max(dp[i-1], dp[i-2] + nums[i])

- 198
- 213  变种，考虑第一个位置选不选转换成198问题
- 2320 dp[i] = dp[i-1] + dp[i-2]
- 740  值域打家劫舍
- 3186 值域打家劫舍, 使用哈希表
- 2140 从右往左进行递推

## 3.最大子数组和
子数组 & 子串等想到 dp[i] 以当前i结尾的最大子数组和
- 53 : dp[i] = max(dp[i-1] + nums[i], nums[i])
- 2606 dp[i] = max(dp[i-1] + nums[i], nums[i])
- 1749 : 同时保留最大和最小值，然后比较
- 1191 : 变种，k=1, k=2, k > 2然后讨论即可
- 918 : 同时保留最大和最小值
- 2321: sum = \sums  s + diff 转成diff数组求解最大子数组和

- 152 : 最大乘积子数组， 注意负数的影响，当存在负数时，对最大和最小进行交换
- 1186 : https://leetcode.cn/problems/maximum-subarray-sum-with-one-deletion/

