/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   1749.任意子数组和的绝对值的最大值.cpp                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: taoyanqi <taoyanqi@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/09/19 17:08:30 by taoyanqi          #+#    #+#             */
/*   Updated: 2025/09/19 17:08:31 by taoyanqi         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

class Solution {
public:
    // 子数组的和为前缀和之差|s_j - s_i|
    // 给一堆数，那两个数差距最大 max(s) - min(s)
    int maxAbsoluteSum(vector<int>& nums) {
        int s = 0, mx = 0, mn = 0;
        for(int x : nums) {
            s += x;
            mx = max(mx, s);
            mn = min(mn, s);
        }
        return mx - mn;
    }
};