/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   0058.最后一个单词的长度.cpp                                 :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: taoyanqi <taoyanqi@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/11/06 12:47:57 by taoyanqi          #+#    #+#             */
/*   Updated: 2025/11/06 12:48:11 by taoyanqi         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

class Solution {
public:
   int lengthOfLastWord(string s) {
       // 实现很精妙，从后往前会更简单
       int i=s.size()-1,len=0;
       while (i >= 0 && s[i]==' ') i--;
       while (i >= 0 && s[i]!=' ') {
           i--;len++;
       }
       return len;
    }
};